Show / Hide Table of Contents
Class Opening
Representation of opening in IDEA StatiCa Detail
Inheritance
System.Object
OpenObject
OpenElementId
Opening
OpeningCirc
OpeningRect
OpeningRectOffsets
Inherited Members
 OpenElementId.Id
 System.Object.ToString()
 System.Object.Equals(System.Object)
 System.Object.Equals(System.Object, System.Object)
 System.Object.ReferenceEquals(System.Object, System.Object)
 System.Object.GetHashCode()
 System.Object.GetType()
 System.Object.MemberwiseClone()
Namespace: IdeaRS.OpenModel.Detail
Assembly: IdeaRS.OpenModel.dll
Syntax
public class Opening : OpenElementId
Constructors
Improve this Doc   View Source
Opening()
Constructor
Declaration
public Opening()
Properties
Improve this Doc   View Source
GeomId
Id representing geometrical parts of Detail
Declaration
public int GeomId { get; set; }
Property Value
 Type |  Description
 System.Int32
Improve this Doc   View Source
InsertPoint
Insert point 0 - 9
Declaration
public int InsertPoint { get; set; }
Property Value
 Type |  Description
 System.Int32
Improve this Doc   View Source
MasterComponent
Master component
Declaration
public ReferenceElement MasterComponent { get; set; }
Property Value
 Type |  Description
 ReferenceElement
Improve this Doc   View Source
MasterPoint
Master point 0 - 9
Declaration
public int MasterPoint { get; set; }
Property Value
 Type |  Description
 System.Int32
Improve this Doc   View Source
Name
Name
Declaration
public string Name { get; set; }
Property Value
 Type |  Description
 System.String
Improve this Doc   View Source
Outline
Outline of Oopening
Declaration
public ReferenceElement Outline { get; set; }
Property Value
 Type |  Description
 ReferenceElement
Improve this Doc   View Source
Position
Offset between MasterPoint and InsertPoint If MasterPoint is null, position is from origin of coordinate system
Declaration
public Vector3D Position { get; set; }
Property Value
 Type |  Description
 Vector3D
 Improve this Doc
 View Source